# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [2]:
# your code here
import sqlalchemy
import pandas as pd
import pymysql

In [3]:
conn_string = 'mysql+pymysql://data-students:iR0nH@cK-D4T4B4S3@34.65.10.136:3306/sakila'

conn = sqlalchemy.create_engine(conn_string)

In [4]:
df_sql = pd.read_sql_query('SELECT * FROM sakila.actor;', conn)

In [5]:
df_sql[0:3]

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33
1         2       NICK  WAHLBERG 2006-02-15 04:34:33
2         3         ED     CHASE 2006-02-15 04:34:33

# Challenge 2 - Working with JSON files

Import the pandas library.

In [6]:
# your code here
import pandas

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [7]:
# your code here
df = pd.read_json (r'/Users/andressalomferrer/Downloads/nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [8]:
# your code here
df.head(2)

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [9]:
# your code here
df['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [10]:
# your code here
df.to_json('/Users/andressalomferrer/Desktop/ironhack/lab/Week 2 labs/lab-import-export/data/nasa-output', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [13]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class','other']

In [14]:
# your code here
import io
import requests
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'
s=requests.get(tst_url).content
shuttle=pd.read_csv(io.StringIO(s.decode('utf-8')),sep=' ')
shuttle.columns=cols

In [15]:
shuttle.columns = cols

Let's verify that this worked by looking at the `head()` function.

In [20]:
# your code here
shuttle.head(3)

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class,other
0,56,0,96,0,52,-4,40,44,4,4
1,50,-1,89,-7,50,0,39,40,2,1
2,53,9,79,0,42,-2,25,37,12,4

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [21]:
# your code here
shuttle.to_csv('/Users/andressalomferrer/Desktop/ironhack/lab/Week 2 labs/lab-import-export/data/shuttle.csv', sep=',', index = False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [22]:
# your code here
astronaut=pd.read_excel('/Users/andressalomferrer/Desktop/ironhack/lab/Week 2 labs/lab-import-export/data/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [24]:
# your code here
astronaut.head(2)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [27]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Physics                                                                35
Aerospace Engineering                                                  33
Mechanical Engineering                                                 30
Aeronautical Engineering                                               28
Electrical Engineering                                                 23
Engineering Science                                                    13
Engineering                                                            12
Mathematics                                                            11
Chemistry                                                              10
Naval Sciences                                                          9
Chemical Engineering                                                    9
Astronautical Engineering                                               8
Aeronautical & Astronautical Engineering                                6
Biology                                                                 5
Civil Engineering                                                       5
Geology                                                                 5
Mathematics & Physics                                                   5
Physics & Astronomy                                                     4
Applied Science & Engineering                                           4
Computer Science                                                        3
Engineering Physics                                                     3
Applied Mathematics                                                     3
Aeronautics & Astronautics                                              3
Chemistry & Biology                                                     2
Engineering Management                                                  2
Physics & Mathematics                                                   2
Education                                                               2
Zoology                                                                 2
Biological Science                                                      2
Engineering Mechanics                                                   2
                                                                       ..
Biology & Psychology                                                    1
Biochemistry                                                            1
Systems Engineering                                                     1
Engineering Sciences; Astronautics & Mathematics                        1
Electrical Engineering; Computer Science                                1
Mechanical & Aeronautical Engineering                                   1
Accounting                                                              1
Industrial Engineering                                                  1
Astronautics                                                            1
Psychology                                                              1
Earth & Planetary Science                                               1
Mathematical & Electrical Science                                       1
Space Physics                                                           1
Applied Biology; Mechanical Engineering                                 1
Physics & Engineering                                                   1
Human Biology                                                           1
Business Management; Aeronautical Engineering                           1
Astronomy                                                               1
Philosophy                                                              1
Solid Earth Sciences                                                    1
Mathematics; Russian                                                    1
Metallurgical Engineering                                               1
Ceramic Engineering                                                     1
Aeronautics & Astronautics; Earth, Atmospheric & Planetary Sciences     1
Business Economics                                                      1
Physics & Astronautical Engineering                                     1
Molecular Biology                                                       1
Bioscience                                                              1
Aerospace Engineering & Mechanics                                       1
Geosciences                                                             1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [32]:
# your code here
astronaut.to_csv('/Users/andressalomferrer/Desktop/ironhack/lab/Week 2 labs/lab-import-export/data/astronauts.csv', sep='\t', index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [ ]:
# your code here